[
  {
    "id": 1,
    "title": "Consider the Lilies",
    "slug": "story1",
    "body": "In high school, my church partnered with an organization called Royal Family Kids Camp. They put on a one week summer camp every year for foster kids in the area. Picture it, a hundred abused and neglected kids being treated like royalty for one week every summer. Beautiful is an understatement. We looked forward to it all year long, as I’m sure the campers did as well. I worked one year in the craft room, which was fun and lighthearted without any real responsibility. But that next year, less than a week after graduating high school, it was time for the big leagues. Counselor. You had to be 18 to be a counselor, me and all my friends had been waiting for this for what felt like forever. It was going to be so much fun. Our campers would love us and feel loved by us and everything would be easy, breezy, beautiful. Oh, the sweet sweet naivety.\n\nI was placed with a cabin full of 9 (going on 16) year olds. They were rough. They had lived through awful things I could never even imagine, they had every right to be. They fought with each other every couple minutes, whether with words or fists. They hit and kicked and spit on me often. I tried to see them through Jesus’ eyes and grew a solid relationship with each one. But again, they were rough. All except for one girl, Lilly. Lilly was upbeat, lively, and fun. She tried so hard to be a peacekeeper amongst the other girls. She always chose to sit with whoever was being left out that day and gave everything she had to make them feel better. She stuck by my side most of the week and we were two peas. While the other two counselors were breaking up fist fights, me and Lilly would be racing to the tree or talking about her favorite animals or her family. Not my finest counselor move, but hey, I was 18 and had no idea how to handle conflict.\n\nAnyways, she loved talking about her family, her mom specifically. She had a photo of her mom pregnant with her in her suitcase. Any time we were in the cabin, she would take it out and show everyone. \"Isn’t she pretty?\", she would ask daily. \"Look how happy she is, it’s cause she already loved me\" I would hear from the other room at least 3 times a day. Then she’d be told to put it away, because some of the other girls were not lucky enough to still have their mothers and it could be hard for them to see that. Then it hit me, of course she was the most well-behaved, she had a good life. She hadn’t seen the horrors that these other girls had causing them to act out.\n\nFast forward to Thursday. Thursday night is the hardest for any counselor. It’s the last night, the night that the campers start remembering the awful things that they have to go back to the next morning. There is a campfire where each camper is asked to write down 3 things. Something along the lines of, \"What is one thing you don’t like about your life? What is one thing you want to change about your life? What is one thing you want for your future?\" Needless to say, emotions are everywhere on campfire night. There’s crying and worshipping and just a hint of anticipation knowing smores were to follow. But mainly crying. Some of the toughest campers finally show how bad things really are at home. The hard facade melts away and the fear is written all over their faces. It is truly heartbreaking.\n\nI had my arms around Lilly and one other camper. Lilly was working hard to give hope to the other campers as they cried. She seemed fine so I shifted my focus to the others who were clearly hurting. As she was comforting a friend, the other girl whispered, \"But we have to go home tomorrow.\" Something changed. It was as if it hadn’t hit her until right then. I looked over and saw Lilly crying hysterically, gasping for breath in between sobs. I held her as she cried and her body was convulsing so hard that mine was visibly moving as well. I didn’t understand. Why was she sad, her life was good, she was one of the lucky ones? Maybe she was just really going to miss the endless dessert? Looking for answers, I glanced over at her paper. In one moment, I went from total confusion to absolute heartbreak. I was wrecked.\n\nWhat is one thing you don’t like about your life? : \"I don’t want mommy to be on drugs anymore\"\nWhat is one thing you want to change about your life? : \"I don’t want mommy’s boyfriends to hurt me anymore\"\n\nI don’t remember what she put for her last answer. I don’t know if I even read it. I didn’t need to. I grabbed her tighter and began to pray. She was such a ray of sunshine, I never could have imagined what she was wrestling with. As I was praying, her brother came over. She hugged him but he pushed her off. He said firmly, \"What are you doing? Why are you crying?\" She kept crying harder and saying how she didn’t want to go home. He simply repeated himself over and over, \"Why are you crying, Lilly? Stop crying.\" At this point I was feeling a little protective and told him it was okay if she needed to cry. But he shook his head unphased and continued, \"Lilly, why are you crying? Stop crying. Don’t you know that God has a plan for us?\" Through her tears, she looked up and nodded as he repeated that sentence a few more times. He had a reputation for being a tough kid, but something got through to him. He got it. What we had been trying to teach all week, he grasped it. He found hope. And he gave it to his sister. They hugged and she turned to me and said, \"We’re gonna be okay, God has a plan, you know?\"\n\nOnly a day or two later, camp was over and everyone was home resting after what felt like the longest week of our lives. I’m in bed sleeping in when I get a call. My sister says, \"Go downstairs, mom needs you, now.\" She briefly told me about something awful that had happened in our family. I won’t get into it, but I knew it was going to be hard. I ran downstairs and my mom fell into my arms. I was scared of what this news would mean for the future and speechless at the sight of my mother so upset. I held her up as she cried, I didn’t know what to do. The only thing I could muster up to say was that simple phrase, \"God has a plan\". She looked at me, nodded, and went about doing the dishes. I sat on the floor of the kitchen and told her this same story and we both had a sense of peace, the kind of peace that only comes from the full faith that God knows what He is doing. Most of the time that is a lot easier said than done, but every now and then it feels like the option is to either trust in His plan or crumble entirely. So, you take a deep breath and close your eyes and trust. In Him and His plan.\n\nThis has been a theme since that night. When things were hectic with my family, I clung to that phrase. When I was sick and no one could tell me what was wrong, I held on to it even tighter. When I lost family members, had to leave college, got a scary diagnosis, or had nowhere to live; every time it still rang true. Every time I got scared I would remember that if these two children who had seen the worst that the world has to offer could trust that the Lord was working all things out, I could too.\n\nSo in case you are wondering if I am scared about fundraising or traveling during Covid or going into some pretty sketchy areas, of course I am. It’s okay to be scared. But the Lord created this plan before I was born, who am I to question it? I heard somewhere that faith is bigger than fear, and I have full faith in His plan. His plan and His timing are perfect, they always have been and they always will be. He has proved that time and time again.\n\nThank You, Lord, that Your plan is good and sovereign and unchangeable, just like You.\n\n-K"
  },
  {
    "id": 2,
    "title": "Goodbye Guatemala",
    "slug": "story2",
    "body": "We had some great events in Guatemala. The Lord provided so much for us through these events. He made a way for the rent to come through so that we would have a church to host them in, He made a way for chairs and tables to be donated. He gave us volunteers and translators willing to work for free. He gave us a budget out of thin air for supplies and cakes. He brought the people to fill the seats and He for sure showed up throughout.\n\nWe had two children’s events and two women’s conferences. For the children’s event split up the kids into two groups by age. I had the older group of 7-12 year olds along with Caitlyn and Brittany. The first event, we did an interactive lesson on the paralyzed man with his four friends who brought him to Jesus. Then we shared with the kids how they could bring their friends to Jesus as well. The event went well and was pure joy! I had the absolute best day of jumping on the trampoline, playing tag, and singing Spanish VBS songs. What a dream.\n\nThe second time we did a children’s event was great as well. We split the kids up the same way and my group spoke on how God sees us. We started by having the kids draw a self portrait. Then I sat next to my favorite kid (favoritism is so real, but shhhh).\n\nI started talking about him to the group. \"This is my friend Marcos. When we look at Marcos we can see that his hair is brown, his eyes are brown, and he has a big smile. I can only see Marcos on the outside, but God sees the inside. God sees his heart.\" Then went on to talk about how God sees him. Brittany prayed for God to speak to the kids and we were silent for a minute or two. Then we told them to draw how God sees them. Marcos leaned over to me and whispered in his sweet little voice, \"Thank you for telling me God sees my heart.\" I melted.\n\nThe kids were drawing but it didn’t seem like they got it. My team asked if we should just end it since it clearly didn’t work or they clearly didn’t understand. But I was not ready to give up. I asked the translator how to ask \"How does God see you?\" and I went one by one asking each kid. Some said words like \"beautiful\" or \"his child\", one even said \"I am the sheep and He is my shepherd\". One said, \"good, even though sometimes I am bad\". They got it. Sometimes we discount kids and assume what is too much for their little brains. I definitely did going into this. But they got it. Each person had their own answer. God showed them how He sees them and I pray they will keep those drawings so they can remember.\n\nAt the first women’s event we each had a different topic to share. Mine was chosen for me: the woman at the well and shame. I spoke and was so surprised when people actually seemed to get it. Women were crying and letting go of their shame left and right. My awkward teaching skills didn’t get in the Lord’s way. He wanted to free them from their shame and He was going to do it no matter how I butchered the lesson. I am so grateful that He chose to use me in this. There was not a dry eye in the house by the end and 7 women gave their lives to Christ that night.\n\nAfterwards, Pastor Alex told us some of these women’s stories. One was the leader of an extortion ring, 3 had just given themselves abortions in their homes, some were living on the streets, some had been raped, some lost their children, some were even sex workers. But Alex chose to tell us afterwards so that it was a testament to what God had done instead of a lense to see them through. He believes strongly that all people should be seen equally, regardless of their background. He taught us how to live that out.\n\nThe second event, we didn’t know what to expect. It ended up being mainly the same 35 women as before. We talked about identity in Christ and how God sees us. I was given the topic of forgiveness. I know what you’re thinking, who would let me speak about forgiveness? *shrug* I don’t know, I just do what I’m told. Lauren is our coordinator for these events and she said however vulnerable we are willing to be, is how vulnerable they will feel comfortable being. So I got reeeeeal vulnerable.\n\nI wasn’t going to let me fear of vulnerability be what stopped these women from experiencing restoration. I talked about my dad, how hard it was to forgive him, and what that process looked like. They were staring at me like, \"Wait what? You don’t seem like you went through that.\" Then I asked them to draw a picture of a situation where they still needed to forgive, even if it was forgiving themselves for the choices they had made in the past. The women were silent. They were just staring at me. I felt like I had failed. This lesson had the power to help them so much, but I must have said it wrong or something. I felt defeated.\n\nI asked Makalah to come up to the front with me and we prayed over them, loudly. We prayed with outstretched arms for their ears to be opened, for the Lord to speak to them, and for their pride to be lowered enough to forgive. We prayed for a hot minute. When I opened my eyes again, they were all drawing. The plan was for them to burn their drawings at the end, burning away all of the bitterness, resentment, and unforgiveness in their hearts. But when I practiced lighting mine on fire, it barely even frayed the edges. There was no way it would work. The paper wouldn’t light. I considered scrapping the whole idea. But we didn’t.\n\nI felt like they would think it was lame and no one would even come up, so I did mine first as an example and Lauren was going to go second to start the crowd. Mine wouldn’t light, in front of all of them. How humiliating. I said it was just for symbolism so it was okay that it barely lit. But on the inside I was getting worried. Lauren’s didn’t light either. I was freaking out.\n\nI didn’t think anyone would come up, but after Lauren the whole crowd swarmed. Again I was thinking, this has the ability to be powerful if only it would work. The first woman who came up was crying, I stared into her eyes and could see the hurt. I prayed out loud, \"God. She. Needs. This.\" Fwooop. The paper lit. The flame was huge. Her whole drawing was ash in less than a minute, as was every drawing after. The women were sobbing and each one went to one of our leaders for prayer. The entire bucket was engulfed in flames. It was more than I could have expected. It was exactly what they needed. One woman spoke of taking her husband out of the hospital for one last day at the beach, when he died that day she was never able to forgive herself, until now.\n\nOne woman came up to me and I quickly ushered a translator over. I mean, I can understand Spanish, but through those sobs, I had no idea what she was saying. She began telling us of her cousin who tried to rape her 30 years ago and how she has never forgiven him. She tried to tell her mother, but she didn’t believe her. She didn’t think she could ever forgive either of them, she didn’t know how to live without that hatred in her heart, she didn’t know if she wanted to. We prayed over her for a long time and put her in touch with Clarita, Pastor Alex’s wife. They talked for a long time more and the next day Clarita told us that the woman had finally forgiven them both and found healing through it all.\n\nEveryone was crying that night and every person got prayer. Again, there were exactly 7 women who gave their lives to Christ. God used it. I was silly for thinking I could mess up God’s plan. I am so grateful that He was able to use my story. I am so grateful that He brought restoration to so many hearts in Mixco. God changed the hearts of these women, thus changing their homes and their families forever. We saw so much change and restoration happen in Mixco, it was hard to leave. It helps to know that God is not done with these women yet.\n\nThank You, God, for the work that You did in Mixco. Thank You, God, that You didn’t leave when we did. Thank You, God, for Your heart for the broken, like them, like me.\n\n-K"
  },
  {
    "id": 3,
    "title": "Silly Little Man-Made Limits",
    "slug": "story3",
    "body": "When my brother, Kai, was 5 he got a jump rope for Christmas. He was obsessed with it. I remember him jumping rope in front of the tv while he watched his favorite movie on repeat. Why do kids do that? Pick a new movie, am I right? Anyways, Kai was jumping rope nonstop that first couple of days after Christmas. I challenged him to see how many times he could jump it in a row without messing up. I jumped first and stopped around 20, you know, to keep it fair. Gotta give the kid some hope. When it was his turn, he got so excited and jumped three times over the rope. Then he stated, “I can only do 3.” We went again. Double or nothing. Again he got three. He tried time and time again but could only get 3 jumps in before messing up.\n\nAs I watched him, I noticed that he was stopping himself after 3. He had told himself that he could only do 3 and he believed it. After the third jump, he wouldn’t even try for the 4th. I said in my most competitive voice, “Kai, this one’s for the win. Let’s see if you can do 4. Sounds wild, but I really think you can do it.” He looked at me like I was crazy. “KK I can’t”, he said. “Try”, I said. He went for it and the darndest thing happened. He hit 4. He jumped 4 times then stopped.\n\nHe was so proud of himself and ran to tell mom that he hit 4. But still, he stopped himself at 4, he didn’t even try for 5 because of the limit he had set up in his own mind. The idea of 4 jumps was so wild, he could never even think of doing 5. After he mastered 4 a couple more times, I told him to do 5. “Ohhhh nooooo, I can’t”, he said. “Try”, I said. And guess what, he did. He even got up to 6 that day. That doesn’t sound like much but he’s like 5 years old okay, this isn’t a story of him getting to 100 or something. 6 jumps is still relatively big.\n\nHe could have gotten to 6 that whole time, but was stuck in the box that he had created for himself. He allowed the limits that he had made up in his own mind to stop him from reaching his full potential. Ouch cause same. I feel like I am constantly putting myself in a box as well. I came to Central America thinking I don’t know how this is going to go since I don’t know Spanish. “I can’t”, I said. “Try”, He said. And somehow God has been using me to translate. What?! When our translators are sick or we need to split up into groups and there aren’t enough translators, people look to me. I have been asked to translate so many times already and I NEVER would have thought that I could learn Spanish on the fly.\n\nI also came to Honduras not knowing how I would be of any assistance in a construction project. I can’t build a church. Everything I know about building is from Bob the Builder. “I can’t”, I said. “Try”, He said”. The Lord has taught me to simply be willing to learn. And guys, I built a door! Like, full on sawed wood to size and hammered it together, sanded it then put it on hinges. I did that. And now it works. It is a real functioning door!\n\nI’m learning not to limit myself based off of what I think I can handle. But more than that I am learning not to limit God. Because, I know I put myself in a box, but how much more have I told God what He was capable of? For instance, Honduras had a lot of negative connotations for me. When I thought back to my time in Honduras, it was always bad or scary or uncomfortable. I never thought that would go away. Even when we first got to Guatemala and I loved it so much, I still didn’t want to move there long term because I couldn’t picture living that close to Honduras. I knew I was called to Central America, but I was too afraid of being anywhere near Honduras again.\n\nBut right now I sit in my tent on the side of a mountain, 20 minutes away from the very city in Honduras that held so much fear for me for so long. I knew that God was a God of redeeming stories. But when someone said maybe this time in Honduras would redeem the country for me, I laughed. What a cute sentiment, they must not understand what I went through here. I never thought it was possible. Just like Kai thought 6 jumps was too much for him, I thought this was too much for God. But He’s been doing exactly that. I’m not scared to be here like I thought I would be. I’m not having PTSD flashbacks like a military movie, the way I thought I would. I feel good. I feel safe. I feel like this is exactly where I am supposed to be right now.\n\nEven the night last week when the police showed up in the dark, fully armored and in military camo. I saw them walking up and everyone screamed. I looked at them and thought to myself, “Why am I not more afraid right now?” I stood there and didn’t flinch, when they walked past me I got a little tense. I wasn’t afraid, but I still wanted to stay as far away from them as possible. They had the exact uniforms I had remembered rushing us out of our home 5 years ago yelling at us to keep our heads down to stay out of range of the gunmen attacking us. I looked at them this time and wasn’t taken back to that moment. I wasn’t overwhelmed by fear. I was okay. I felt the Lord say, “I will restore this if you will let me”. “Lord I can’t”, I said. “Try”, He said. My flesh didn’t want to be anywhere near them, but I knew that I had to allow the Lord to work in the moment.\n\nI went into the kitchen and helped Carmen make the officers a sandwich and coffee. I brought each officer a plate and said, “Dios te bendiga”. God bless you. It was scary, but the kind of scary that you know is necessary. The kind that you know is healing. The police chief was friends with our host and so they had come to make sure we were all good and felt safe. When someone asked who wanted to pray over them, it was silent for a long time, my heart dropped. No one was volunteering. “Lord, I can’t”, I said. “Try”, He said. I volunteered. I prayed over the officers and even took photos with them. Afterwards, one of the younger officers came up to me and we shared tongue twisters back and forth along with my hosts. It was just me, my hosts Paul and Tonya, and 6 officers laughing at my interpretation of silly Honduran tongue twisters.\n\nI never thought that I could feel safe in Honduras again. The country as a whole but especially not 20 minutes away from that city and surrounded by armed officers. But that night I did. I went to bed smiling and thinking to myself, “God, You didn’t have to do that.” I was already feeling better about Honduras, but He used something that would have been a trigger, to show me the progress He has made in my heart. He is so good. I never thought it was possible. That was a limit that I had set up for Him. He tore right on through like it was nothing. He is strong and fierce, yet still so gentle with me in the process.\n\nThank You, Father, that You don’t stay within the parameters I make up for You. Continue shattering all of my expectations of You. Continue showing me that I have no reason to fear. You are bigger. Continue teaching me this.\n\n-K"
  },
  {
    "id": 4,
    "title": "Casa Esperanza",
    "slug": "story4",
    "body": "Towards the end of our time in Costa Rica, we were told that Nicaragua would be “ATL” month. That means that normally when we would be told specifically where we would live and what ministry we would work with, this month was all on us to figure out. Well, not really, ATL stands for “Ask The Lord”. So this month has been all about leaving room for Him to lead. We prayed about where to work in Nicaragua and all had different ideas of what the Lord was telling us. Some words that floated around amongst our team were “women”, “sex trafficking”, “Managua”, and “children”. We had no idea where to go from there.\n\nOne day, our Squad Leader, Abby, called. We have two squad leaders that switch off which teams they are with of the six. Abby called to say that she had been praying and kept thinking about our team. She said she couldn’t stop thinking about our team. A woman she had worked with back in the states heard she was in Nicaragua and told her about a ministry called House of Hope that desperately needed volunteers, if she knew anyone interested. Abby began praying again and continued to hear our team’s name. She brought the idea to us and we prayed on it. She also found out after that she would be with our team for ATL month. So that was cool.\n\nTurns out, House of Hope is a shelter for women that have been pulled out of prostitution and their children in the city of Managua. It checked all of our boxes, so we decided to go for it. We slept in a back room on the floor and had bathrooms with no running water. Some of our friends were staying at fancy hostels or nice resort-like homes, but we didn’t mind. We knew that we were there for a reason, we just didn’t know what it was yet. No one spoke English, but we took it as an excuse to practice Spanish. It was a lot of choosing to see the good in all things. I started praying every morning that the Lord would show Himself in the small things, that we would find joy in every moment. And man, did He deliver.\n\nWe got to play with the kids and press into the mothers all day long. These women that we were told had lied, cheated, stolen, and killed men, were braiding our hair and playing Red Rover with us and the kids. God is so good at redeeming stories. He chases down what feels too far gone. There is a butterfly on the logo and the woman who designed it told me that butterflies live so much of their lives ugly and dirty, crawling on the floor as caterpillars. They then experience a phenomenal change and turn into something beautiful, something new. That is the goal at House of Hope as well. The Lord brings women to House of Hope and orchestrates a change like this, butterfly from caterpillar, wonder from normalcy, beauty from ashes.\n\nOnly God can do something like that. House of Hope has an on-site therapist, many classes on parenting and sexual assault, Bible studies, devotionals, and an incredible staff. Yet still, only God can do something like that. This ministry brought me so much joy. The little girls putting flowers in my hair while I sat in the grass, kids coloring family portraits that included all of the women at the shelter, sitting at a long table for lunch and laughing with the 14 women plus all of their kids as if we had known each other forever. It felt like one big family and every day was a holiday. The kids would get home from school and run into our arms. The moms would rush to serve us first at lunch. God’s love for us so clearly on display every day. It was just fun. It was just beautiful.\n\nOur impact was seen there. We didn’t change these women’s lives. We didn’t get these kids into school. We didn’t provide the food or the housing. God and the ministry did that. But when we showed up, there was a change. The atmosphere shifted. They hadn’t had a team in seven years. Nicaragua as a whole had felt forgotten. This ministry was no different. A lot of these women have lived at House of Hope for over 5 years. They either knew of or heard stories of teams in the past. It was so beautiful to help in this way. They didn’t need us, they were self-sufficient. But they wanted us, they wanted our joy. God didn’t need us, but He chose to use us. He chose to bring them joy through us.\n\nWe spent two weeks at this ministry, getting to know moms and loving on the kids. We organized craft rooms, held a women’s conference, prayed over people, washed feet, but most importantly we loved them. With no agenda, no ulterior motives, nothing, we just loved them. Just for the sake of loving them. We showed them that they were so worth loving.\n\nThank You, Lord, for showing us Your love for us in the little things these past two weeks. Thank You for meeting us where we are at and sometimes where we are at is just wanting to play. Thank You for showing us how You see us, not as who we were, not as our choices, not as our old lives, but as who You created us to be; as Your daughters, as Yours.\n\n-K"
  },
  {
    "id": 5,
    "title": "To Be Treasured",
    "slug": "story5",
    "body": "It’s true when they say God knows the desires of your heart. I desired to be used by Him. That has always been my number one desire. I remember countless nights in worship at youth group, begging the Lord to use me.\n\nI came on this race expectant. I knew that He would use me, my story, my heart, my gifts, all of it. And He has. He has used me in ways that I never would have thought of on my own. It’s been wild. But the weirdest part for me was what He hadn’t used. I came on the race knowing my strengths and gifts and thinking I knew exactly what avenues He would use to use me. The main one was photography. Every mission trip I’ve ever been on, I’ve been the photographer. I figured this trip would be no different and packed all of my camera equipment. Equipment that has very rarely been taken out of my bag these past four months at all.\n\nI’m on a team with another photographer. She’s so passionate about it. It’s new for her, she’s constantly learning and growing. She is incredible. She takes her camera everywhere, meaning that I don’t have too. This gift that I thought would be a huge part of what I had to offer in missions, I have still yet to use. I realized that recently. I saw that my camera has quite literally been gathering dust. I was meditating on this one night, wondering why, wondering when I would get the chance to use it, wishing I could. We were at a ministry where we were originally told we could not take any photos. Why was I just now getting passionate about photography again when I couldn’t use it? I went so long without taking photos, but now it was like I craved it. I wanted to take photos so bad.\n\nA week later we headed to our new ministry. We had met a lovely young couple at the English speaking church and decided to do ministry with them for our last week. They are from the States and around our age so it was so nice being able to talk about musicians and memes and Ruth Bader Ginsburg. I learned so much about ministry from them and how to help an organization succeed without thinking we know better as Americans. They were really passionate about that, me too.\n\nWe went over the needs of the ministry the first night. One big one being media content. Alex is the volunteer coordinator and Jameson is the fundraising coordinator. He said that they needed photos of classrooms, teachers, students, a video tour, all of it. I got so excited. Photography for ministry? What a dream. He said he wished they had better content for Giving Tuesday, the website, to send to sponsors, etc. The engagement rate on their social media was low, he assumed because the quality of the photos weren’t great. Better content meant more donations that could actually really help the organization. It mattered. My photos mattered.\n\nThe next day, we headed to ministry. A place called Tesoro’s De Dios, God’s Treasures. It is the most insane place. They have all kinds of therapies for children with special needs, physical therapy, speech therapy, family therapy, and the coolest part: horse therapy. Depending on ability level, kids would ride the horses doing different activities. There was a child in a wheelchair that rode the horses to stimulate the same muscles that would be moved if he walked. There was a child that rode the horse while doing math equations to stimulate his brain in multitasking. There was a child that rode the horse while moving his hands up and down or side to side as instructed to strengthen his core muscles and full body. It was the coolest thing to watch. They all loved it. Some passed a ball back and forth, some put blocks on a string, some had to call out numbers and colors, all while riding the horses.\n\nI truly loved the people at Tesoro’s. Mucho. I never wanted to leave. The ministry is incredible. They educate local schools and churches on how to be more accessible to these families. They do home visits delivering bags of food to the families that attend. They have computer classes and special needs teachers. They lead Bible studies for the moms to have a community that understands. All at no cost to these families. They even pick everyone up and drop them back off after in a big bus every day so that it is accessible to all.\n\nI’ve never worked with a ministry like this before. They saw a need and filled it so well. They serve 130 families right now and have over 100 on the waitlist. They just need more resources, money, teachers, land, all of it. Taking photos here felt so purposeful. I felt so seen by the Lord. So used by Him. It was so special. I had free roam to walk around getting pictures for a couple days. It was a dream. The Lord put a desire on my heart to do it more. When we left Tesoro’s, we headed back to House of Hope. It just so happened that they needed media content as well that day. I walked around the campus, taking videos of each woman in their homes with their children. They each made a video thanking their sponsors back in the states as I directed them. It felt like a dream day.\n\nMy creative side was able to soar that day. All of the House of Hope media was shot a while ago by an older woman with an older phone, blurry selfies and awkwardly angled close up videos. Being able to send good quality photos and videos to the ministry to use for supporters and media content was incredible for both of us. They were so grateful. It helped so much. Ministry is a lot of planting seeds or watering and yes sometimes even harvesting. It’s a lot of never seeing the results or how you helped. But this was such a practical, hands on, way to support the ministry. I was able to see the effect that was made right away. That was an incredible feeling.\n\nA day full of using my creative gifts to serve. A day full of pressing into what He has given me and giving it back to Him. A day full of feeling treasured by God. A day of worship through my art. A dream day.\n\nThank You, Lord, for using me, when I can see it right away and when I can’t. Thank You for knowing the desires of my heart and sending me to ministries with that very need. Thank You for orchestrating this day so beautifully to glorify You alone. It’s not for me, or my gifts, or these ministries, its for You, all for You.\n\n-K"
  },
  {
    "id": 6,
    "title": "Shadrach, Putin, And My Super Cool Ukrainian Friend",
    "slug": "story6",
    "body": "I spent last month working with some really cool people. My team was incredible, the ministry was amazing, the local and international friends that donated to help the refugees absolutely blew my mind with their generosity. People are just cool, man. As I’ve mentioned before, I had the opportunity to live alongside Ukrainians fleeing war. At times, the language barrier was pretty hard, but thank God for Google Translate and the love that transcends all tongues. Plus, luckily, many of them actually did know some English. Like my friend Alex, for example. He came to our church with his super sweet wife and the cutest three daughters. We get a lot of Ukrainians cycling through, but it did not take long to realize that something was different about this family.\n\nThe first day I met his wife Anya, I thought she was a reporter. I had just done an interview with the Bucharest Journal the day before, so since they asked me to take her to interview some of the refugees, I just assumed she was a journalist as well. On the car ride, I watched her check the news and messages from worried friends often. I saw in her face how much it was hurting her. I just thought she was an empath. Honestly, it made me excited to read her piece. But as it turned out, she was Ukrainian as well. She was interviewing her fellow refugees to make a video to send home to show her community that it was safe to leave. Her heart was to help those still stuck in Ukraine to know that they would be taken care of and safe here. Her and Alex made multiple videos during their first week in Romania. Some for Ukraine as an encouragement to come, some for the U.S. to thank everyone who had donated, some to get more donations for the ministry, some just to let their families know they were safe.\n\nThis turned into more work for the ministry quickly. It wasn’t long until Alex was translating for all of the refugees and even leading their welcome briefings. Alex has probably met over 200 Ukrainians, just being here in Romania. The ministry has begun to rely on him. The Lord used Alex more than he ever could have thought possible. He was just trying to get his family safe, he had no idea what was waiting for him in Romania.\n\nThere was one day that sticks out to me the most. The pastor was speaking to around 20 Ukrainians, encouraging them through a Bible story. He told the story of Shadrach, Meshach, and Abednego, Daniel’s friends who refused to bow down to King Nebuchadnezzar and were thrown into a fiery furnace as punishment. I’ve always loved this story in Daniel 3. The three men stood in the furnace, but came out unburned. More than that, when the people looked into the furnace, they saw 4 people standing there, an angel amongst them, protecting them. Nebuchadnezzar saw this and exclaimed, “Praise be to the God of Shadrach, Meshach, and Abednego, who has sent His angel and rescued His servants!” (verse 28). He went on to declare that their God must be the one true God and believed.\n\nThe pastor shared this story to tell the refugees that they were not alone in their hurting and pain. There is another in their fire, standing next to them, taking care of them. He told them how Jesus is with them and that they can rely on Him to do the impossible, as with these three men in the book of Daniel. It was a powerful message. I watched Alex translate while many of the women cried or nodded their heads in agreement. They had hope. They would be okay. They trusted in what the pastor and Alex were sharing. They trusted in the Lord.\n\nAfter the message, we headed to the mall with the pastor, Alex, Anya, and their youngest child. Their middle daughter would turn seven in a couple days and they wanted to get her a gift. All she wanted was a small stuffed dog. We were all on a mission and ready to search high and low for that thing to give her some joy and normalcy. We found out today that their city had been hit. Odessa was in shambles. Their home, their neighbors, their church, gone. They had nothing to go back to. In the car, I overheard the pastor and Alex talking. They got on the subject of the war, which is pretty easy since it is constantly on their minds every second of the day anyways. They spoke of Vladimir Putin and the damage that he has caused. The pastor began, “Putin is a bad man”. Anya stared out the window solemnly, holding her little girl as she whispered, “The very worst man”. He continued, “He has hurt so many and doesn’t even care what he is doing to people”. Alex agreed that it was awful, “He is our Nebuchadnezzar”, he added, “The king that hurts people for the sake of his own pride”.\n\nI studied their faces as they continued talking about the similarities. I could see the pain, the fear, the anger, the hatred, until one specific moment. His face changed. I saw Alex take a deep breath and soften his gaze. He didn’t look angry anymore, he looked hurt. He glanced back at his crying wife and sleeping child, then looked to the pastor. The next sentence looked like it took everything out of him to say. He declared something so true, so pivotal, yet so hard in the midst of brokenness caused by one single person. He said, “But in the end of the story, even this violent man, this King Nebuchadnezzar, turned to God.” He went on to tell the pastor how he would choose to pray for Putin, instead of hating him. This man that had caused so much destruction and changed Alex’s life as he knew it, this man that had uprooted his family, killed his friends, and caused heartache in countless more ways, was now Alex’s main prayer request. He would go on to choose prayer over bitterness, hope over anger, forgiveness over hatred.\n\nCan you imagine? I always hear stories of mothers forgiving their son’s killers and I am awestruck by it. I don’t know that I have that kind of mercy in me to give. But this? A man that has destroyed Alex’s whole country! That’s insane! That’s unheard of. Could you imagine a Jewish person forgiving Hitler during the time that his reign was the most fierce? I could never. I have been known to not be the best about forgiveness, I still hold a grudge from that one time my grandma told me there was no mayonnaise in the dinner she had cooked. There was. I hate mayonnaise. I still don’t trust her cooking. But I guess this whole forgiveness thing is pretty cool. Praying for the ones that have hurt you the most, seems Biblical.\n\nProbably because it is. In Matthew 5:44 Jesus tells the people, “Love your enemies and pray for those who persecute you.” Jesus Himself cried out on behalf of those who hurt Him, literally as He hung on the cross dying, saying, “Forgive them Father, they know not what they do” as seen in Luke 23:34.\n\nI can think of a few people that I still need to forgive (…Grandma). When I think of the things that seem too big for me to forgive, I think of Alex. No one has ever killed my family and friends, destroyed my church, bombed my city, or made my family homeless and on the run. Yet I still think there are things too big to get over. That seems so silly in comparison. I thought of a couple names just while typing this out today. I’m sure one or two have come to your mind as well. I’m not naive enough to think we can all just get over the ways that those people have hurt us in one day, one quick “You’re forgiven” and we’re chillin. But I do think that realizing that we still harbor unforgiveness in our hearts and recognizing that it does not need to make its home there is a good segue into forgiveness. “Admittance is the first step” or whatever.\n\nI don’t know how long the process will take, I don’t know how much it will hurt to dive into, but I know it’s worth it. I know there is freedom in forgiveness. I saw it in Alex’s face. I saw him live it out every day after that. He was different after that day, I want to be different too. I want to walk in that same freedom, leaving unforgiveness and resentment behind. I won’t claim to know how to have that freedom in three quick easy steps, but I do know one thing for certain: it starts with Jesus. Let’s let Him lead us in that today, however He desires to. I’m thankful that He was with me in the fire and that He is still with me now. He knows the hurt, He saw it happen. He saw me crying on the floor, He saw Alex’s city in flames, He saw your pain too. He knows our hurt, He knows our hearts, He knows how to mend the broken pieces within us. Forgiveness is hard, but healing, scary, but necessary. I pray that we press into that.\n\nLord, thank You for this reminder today to forgive. Thank You for this example of forgiveness in a capacity that I can’t even fathom. Teach me how to forgive how Alex forgave. Teach me how to forgive how You forgave. Speak Your truth over the hurt, continue speaking it every day.\n-K"
  },
  {
    "id": 7,
    "title": "Last Stop: Swaziland",
    "slug": "story7",
    "body": "Call it Swaziland, call it Eswatini, call it whatever you want, my last country of the race was pretty different from anything I could have expected. Swazi is a less developed country and definitely not a tourist spot. At least, not where we were. It was a wild ride, but it was an incredible experience.\n\nHighlight: All squad month! All 24 of us were together in one two-bedroom house (and some in tents outside due to lack of beds). The craziness of getting 24 people through one shower and cooking in one tiny kitchen was only worth it because of the sweet fellowship that came with sharing meals and dance parties. We ended many nights with ultimate frisbee out front or card games on the one couch and fold-out chairs. Ending this year together was the best possible way to go out. We needed that community; we were all aware of how different things would be when we got home. Whenever I felt ready to finish this year, I remembered to take it all in, to make the most of every second living in such close proximity with all of my best friends.\n\nWe spent the mornings working in a preschool. We played with the kids, danced a lot, and helped draw out worksheets by hand. I walked in on the first day so excited. As a preschool teacher in the past I knew I was in my wheelhouse. Except one slight snag: these toddlers did not speak any English. Whelp, thumbs ups and fist pounds it is. It was hard but so fun. I definitely had favorites! Be real, we all do.\n\nIn the afternoons, the nearby schools would let out and all the kids would rush to the feeding center to get food. They had to sit through the entire program before they could eat. It was kinda like a Young Life-y youth group type vibe. We played games and hung out, lots of soccer and Cha Cha Slide. Jacob would play his guitar as we all danced around, then the leader would give a sermon. After all of this was over, they were allowed to get the food.\n\nFeed My Starving Children sends food all over the world, and I even had the opportunity to pack boxes years ago on a school service project. But it was so different actually helping the old women in the kitchen prepare it and spoon it to children who hadn’t eaten since the last time I handed them the same dirty bowl the day before. Some kids picked at it without eating much, telling me their parents said they had to bring it home to share with the whole family for dinner. Every single day.\n\nI noticed the kids being enamored with our jewelry. They always stared at our bracelets and played with our earrings. In one day, I would probably have around 30 different hands on my small flower necklace. Not just preschoolers, school-aged kids got in on it as well, even the teenagers thought it was so cool and couldn’t stop touching our anklets or necklaces. We talked about maybe looking into buying beads for the kids or strings to make their own friendship bracelets.\n\nWe had the opportunity to lead the lesson one day. We thought for a while about what to share with the large group of children from preschool to high school. I kept thinking of their obsession with our jewelry and Jacob had a great idea! He said we should make salvation bracelets. We had already bought the beads and were sitting there the day of the lesson when Jacob gave this idea AND asked me to lead it. The idea is simple: you tell the story of the Gospel using the colors from the beads. Green signified newness, black signified sin, red like blood, and white like purity. We even included gold to talk about Heaven.\n\nI told some rendition of that story in front of nearly 100 kids. We handed out string and beads in all the colors. Every kid made a bracelet, and there were even enough for us to make some too. Me, Jacob, and Emmery walked around asking what each color stood for. The craziest thing… THEY KNEW. They could basically tell the whole Gospel story back to us. It worked perfectly. Days went by and the kids all left their bracelets on. Every afternoon, they would come running up to show me they still had them. The sweetest thing.\n\nLord, remind me that You are using everything. Everything. For so much more than I can even imagine. I just wanted to give them a fun accessory. You wanted to change their lives, their families, their community. Thank You. For all of it.\n\n-K"
  },
  {
    "id": 8,
    "title": "27 Doctors, 21 Translators, 487 Prostitutes, & Me",
    "slug": "story8",
    "body": "What. A. Week.\n\nI'm back in Nicaragua and we are busier than ever. We had a clinic at House of Hope and it was amazing! An entire week of checkups, gynecology exams, and all things medical. A group of doctors came to staff the clinic and translators volunteered their time. These 27 doctors gave up their time for an entire week to do all of this for free. Some were specialists and surgeons who could have been earning their time elsewhere.\n\nThey worked from 8:30 am to 5 pm every day on patient after patient with as few supplies as possible. They made-do and improvised what they didn’t have. They ate peanut butter and jelly sandwiches in the hot sun, all with a smile. Even when half of their medications were confiscated at the airport, they continued with what they had. Watching them treat each woman with dignity and respect was incredible.\n\nThe women were invited in time slots through nine neighborhood Bible study groups. Each day, the volunteers guided them to the necessary specialists and listened to their stories. We had sections for general medicine, pediatrics, gynecology, ophthalmology, physical therapy, ultrasound, pharmacy, and dental care. The dentists taught proper brushing techniques and handed out toothbrushes. The patients received much more than physical healing; the entire clinic was covered in prayer.\n\nWe averaged around 100 women each day. Seeing their faces light up as their needs were met completely free was inspiring. Visiting the brothels and seeing the lines of anticipating faces made all the hard work worthwhile.\n\nI haven’t posted a blog in a while, but this week was so encouraging I had to share. God is moving. He has not grown stagnant, just ask one of the hundreds of women who felt Him this week.\n\nThank You, Lord, for Your provision. Continue providing for these women and remind me that You are providing for me as well.\n\nAmen.\n-K"
  }
]
